
## Plan Result

[CI link](https://github.com/mountaincenter/aws-ecs-terraform/actions/runs/4272527559)


<pre><code>Plan: 12 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.vpc.aws_nat_gateway.this[0]
  * module.vpc.aws_nat_gateway.this[1]
  * module.vpc.aws_route.private_nat_gateway[0]
  * module.vpc.aws_route.private_nat_gateway[1]
  * module.vpc.aws_route_table_association.private[0]
  * module.vpc.aws_route_table_association.private[1]
  * module.vpc.aws_route_table_association.public[0]
  * module.vpc.aws_route_table_association.public[1]
  * module.vpc.aws_subnet.private[0]
  * module.vpc.aws_subnet.private[1]
  * module.vpc.aws_subnet.public[0]
  * module.vpc.aws_subnet.public[1]
* Update
  * module.vpc.aws_eip.nat[0]
  * module.vpc.aws_eip.nat[1]
  * module.vpc.aws_route_table.private[0]
  * module.vpc.aws_route_table.private[1]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0599a3100d34e9f84"
      ~ tags                 = {
          ~ "Name" = "aws-ecs-terraform-ap-northeast-1-1a" -> "aws-ecs-terraform-ap-northeast-1a"
        }
      ~ tags_all             = {
          ~ "Name" = "aws-ecs-terraform-ap-northeast-1-1a" -> "aws-ecs-terraform-ap-northeast-1a"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-07061d938fbfad8f5"
      ~ tags                 = {
          ~ "Name" = "aws-ecs-terraform-ap-northeast-1-1c" -> "aws-ecs-terraform-ap-northeast-1c"
        }
      ~ tags_all             = {
          ~ "Name" = "aws-ecs-terraform-ap-northeast-1-1c" -> "aws-ecs-terraform-ap-northeast-1c"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-0599a3100d34e9f84"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-07061d938fbfad8f5"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0facaa142b50b98e4"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-097015049d8e138b6"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0facaa142b50b98e4"
      ~ tags             = {
          ~ "Name" = "aws-ecs-terraform-private-ap-northeast-1-1a" -> "aws-ecs-terraform-private-ap-northeast-1a"
        }
      ~ tags_all         = {
          ~ "Name" = "aws-ecs-terraform-private-ap-northeast-1-1a" -> "aws-ecs-terraform-private-ap-northeast-1a"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-097015049d8e138b6"
      ~ tags             = {
          ~ "Name" = "aws-ecs-terraform-private-ap-northeast-1-1c" -> "aws-ecs-terraform-private-ap-northeast-1c"
        }
      ~ tags_all         = {
          ~ "Name" = "aws-ecs-terraform-private-ap-northeast-1-1c" -> "aws-ecs-terraform-private-ap-northeast-1c"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-0facaa142b50b98e4"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-097015049d8e138b6"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0e37aaa8c44d1d159"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0e37aaa8c44d1d159"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1a"
        }
      + tags_all                                       = {
          + "Name" = "Private Subnet 1a"
        }
      + vpc_id                                         = "vpc-0a6a8776c40f22184"
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1c"
        }
      + tags_all                                       = {
          + "Name" = "Private Subnet 1c"
        }
      + vpc_id                                         = "vpc-0a6a8776c40f22184"
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1a"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet 1a"
        }
      + vpc_id                                         = "vpc-0a6a8776c40f22184"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1c"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet 1c"
        }
      + vpc_id                                         = "vpc-0a6a8776c40f22184"
    }

Plan: 12 to add, 4 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0e37aaa8c44d1d159"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0cb316425b8ecde06"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "aws-ecs-terraform-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"a137adca1faea2de83e0916dd0ece82bf5420812","Vars":{},"WorkflowName":"Terraform"} -->